{
  "teachers": [
    {
      "name": "Adam Cannon",
      "department" : "Computer Science",
      "date": "05/12/2021",
      "content": "Professor Cannon is super nice and makes the lectures engaging. His online lecture was my only class that was able to sort of replicate an in-person experience. \n My only complaint with the course was the grade weighting. Be warned, the class was not curved this semester since we had no mid-term or final. After the pdf deadline, we received a notification from courseworks that the grade weights had changed. This caused averages to drop by around three points and for me, a full letter grade (I'm not sure if this was a mistake on Cannon's part or...",
      "agree": 12,
      "disagree": 5
    },
    {
      "name": "Adam Cannon",
      "department" : "Computer Science",
      "date": "05/12/2021",
      "content": "Professor Cannon is super nice and makes the lectures engaging. His online lecture was my only class that was able to sort of replicate an in-person experience. \n My only complaint with the course was the grade weighting. Be warned, the class was not curved this semester since we had no mid-term or final. After the pdf deadline, we received a notification from courseworks that the grade weights had changed. This caused averages to drop by around three points and for me, a full letter grade (I'm not sure if this was a mistake on Cannon's part or courseworks but it was frustrating regardless)...",
      "agree": 12,
      "disagree": 5
    },
    {
      "name": "Adam Cannon",
      "department" : "Computer Science",
      "date": "05/12/2021",
      "content": "Professor Cannon is super nice and makes the lectures engaging. His online lecture was my only class that was able to sort of replicate an in-person experience. \n My only complaint with the course was the grade weighting. Be warned, the class was not curved this semester since we had no mid-term or final. After the pdf deadline, we received a notification from courseworks that the grade weights had changed. This caused averages to drop by around three points and for me, a full...",
      "agree": 12,
      "disagree": 5
    },
    {
      "name": "Adam Cannon",
      "department" : "Computer Science",
      "date": "05/12/2021",
      "content": "Professor Cannon is super nice and makes the lectures engaging. His online lecture was my only class that was able to sort of replicate an in-person experience. \n My only complaint with the course was the grade weighting. Be warned, the class was not curved this semester since we had no mid-term or final. After the pdf deadline, we received a notification from courseworks that the grade weights had changed. This caused averages to drop by around three points and for me, a full letter grade (I'm not sure if this was a mistake on Cannon's part or courseworks but it was...",
      "agree": 12,
      "disagree": 5
    }
  ]
}